daniel0076/CC1101_PSOC6/CC1101_PSOC6.cpp
    temperature = (adc_result * CC1101_TEMP_ADC_MV) / CC1101_TEMP_CELS_CO;

    ptemp_Arr[0] = temperature / 10;      //cut last digit
    ptemp_Arr[1] = temperature % 10;      //isolate last digit

    spi_write_register(PTEST,0x7F);       //writes 0x7F back to PTest (app. note)

    receive();
    return (*ptemp_Arr);
}
//-------------------------------[end]------------------------------------------
*/

//|==================== SPI Interface Initialization for CC1101 =========================|
void CC1101::spi_begin(void)
{

    //|--- Activating the SPI interface of PSOC62 --------|
    //|--- The Macros are defined in pins.h -------------|

   /* configure all SPI related pins */
    cy_rslt_t result = cyhal_spi_init( &hal_SPI, SPI_MOSI, SPI_MISO, SPI_SCLK,
                             SPI_CSN, NULL, 8, CYHAL_SPI_MODE_00_MSB, false);
    if (result != CY_RSLT_SUCCESS)
    {
        handle_error();
    }
    result = cyhal_spi_set_frequency(&hal_SPI, 1000000);    // CC1101 works around 1MHz clock;
    if (result != CY_RSLT_SUCCESS)
    {
        handle_error();
    }

}
//-------------------------------[end]------------------------------------------

void CC1101::GDO_set()
{
    cyhal_gpio_init(SPI_GDO0, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLDOWN, 0);
    cyhal_gpio_init(SPI_GDO2, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLDOWN, 0);
}

/*
//|==================== SPI Initialisation for CC1101 =========================|

void CC1101::spi_end(void)
{
    pinMode(SCK_PIN, INPUT);
    pinMode(MOSI_PIN, INPUT);
    pinMode(MISO_PIN, INPUT);
    pinMode(SS_PIN, INPUT);

   SPCR = ((0<<SPE) |                   // SPI Enable
           (0<<SPIE)|                   // SPI Interupt Enable
           (0<<DORD)|                   // Data Order (0:MSB first / 1:LSB first)
           (1<<MSTR)|                   // Master/Slave select
           (0<<SPR1)|(0<<SPR0)|         // SPI Clock Rate ( 0 0 = osc/4; 0 1 = osc/16; 1 0 = osc/64; 1 1= 0sc/128)
           (0<<CPOL)|                   // Clock Polarity (0:SCK low / 1:SCK hi when idle)
           (0<<CPHA));                  // Clock Phase (0:leading / 1:trailing edge sampling)

   SPSR =  (0<<SPI2X);                  // Double Clock Rate
}
//-------------------------------[end]------------------------------------------
*/


//|============================= SPI Transmission =============================|
uint8_t CC1101::spi_putc(uint8_t data)
{
    uint32_t status;
    Cy_SCB_SPI_Write(hal_SPI.base, data);
    while (Cy_SCB_SPI_IsTxComplete(hal_SPI.base) == false) { }
    while (Cy_SCB_SPI_GetNumInRxFifo(hal_SPI.base) == 0) { } /* Wait for RX FIFO not empty */
    status = Cy_SCB_SPI_Read(hal_SPI.base);

    return (uint8_t)status;
}
//|==================== write strobe command  ==============================|
void CC1101::spi_write_strobe(uint8_t spi_instr)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SI_IS_HIGH());  // Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr);
    SPI_DRIVE_CSN_HIGH();         // CS high
}
//|======================= Read status byte ==================================|
/*
uint8_t CC1101::spi_read_status(uint8_t spi_instr)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SO_IS_HIGH());  // Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | Read_burst);
    spi_instr = spi_putc(0xFF);
    SPI_DRIVE_CSN_HIGH();         // CS high

    return spi_instr;
}
*/
//|========================== Read registers ==============================|
uint8_t CC1101::spi_read_register(uint8_t spi_instr)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SO_IS_HIGH());  // Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | READ_SINGLE_BYTE);
    spi_instr = spi_putc(0xFF);
    SPI_DRIVE_CSN_HIGH();         // CS high

    return spi_instr;
}
//|========== Read multiple registers in burst mode ========|
void CC1101::spi_read_burst(uint8_t spi_instr, uint8_t *pArr, uint8_t length)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SO_IS_HIGH());  //Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | READ_BURST);

    for(uint8_t i=0; i<length; i++)
        {
            pArr[i] = spi_putc(0xFF);
        }

    SPI_DRIVE_CSN_HIGH();
}
//|======================= Write registers =============================|
void CC1101::spi_write_register(uint8_t spi_instr, uint8_t value)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SO_IS_HIGH());  //Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | WRITE_SINGLE_BYTE);
    spi_putc(value);
    SPI_DRIVE_CSN_HIGH();
}
//|======= Write multiple registers in burst mode =======|
void CC1101::spi_write_burst(uint8_t spi_instr, uint8_t *pArr, uint8_t length)
{
    SPI_DRIVE_CSN_LOW();          // CS low
    while (SPI_SO_IS_HIGH());  //Wait until MOSI_PIN becomes LOW
    spi_putc(spi_instr | WRITE_BURST);

    for(uint8_t i=0; i<length ;i++)
    {
        spi_putc(pArr[i]);
    }

    SPI_DRIVE_CSN_HIGH();
}
//|=================================== END ====================================|


//|=========================== UART helper ====================================|

/*******************************************************************************
Function: uart_puthex_nibble()
Purpose:  transmit lower nibble as ASCII-hex to UART
Input:    byte value
Returns:  none
This functions has been added by Martin Thomas <eversmith@heizung-thomas.de>
Don't blame P. Fleury if it doesn't work ;-)
*******************************************************************************/
void CC1101::uart_puthex_nibble(const unsigned char b)
{
    unsigned char  c = b & 0x0f;
    if (c>9) c += 'A'-10;
    else c += '0';
    printf("%c", c);                  //uart_putc replaced to Serial.write
} /* uart_puthex_nibble */

/*******************************************************************************
Function: uart_puthex_byte()
Purpose:  transmit upper and lower nibble as ASCII-hex to UART
Input:    byte value
Returns:  none
This functions has been added by Martin Thomas <eversmith@heizung-thomas.de>
Don't blame P. Fleury if it doesn't work ;-)
*******************************************************************************/
void CC1101::uart_puthex_byte(const unsigned char b)
{
    uart_puthex_nibble(b>>4);
    uart_puthex_nibble(b);
} /* uart_puthex_byte */

void CC1101::handle_error(void)
{
    /* Disable all interrupts. */
    __disable_irq();
    printf("SPI Init Failed\r\n");

    CY_ASSERT(0);
}
